Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 54, 54, 96)        34944
_________________________________________________________________
activation_1 (Activation)    (None, 54, 54, 96)        0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 27, 27, 96)        0
_________________________________________________________________
batch_normalization_1 (Batch (None, 27, 27, 96)        384
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 17, 17, 256)       2973952
_________________________________________________________________
activation_2 (Activation)    (None, 17, 17, 256)       0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 256)         0
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 256)         1024
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 6, 384)         885120
_________________________________________________________________
activation_3 (Activation)    (None, 6, 6, 384)         0
_________________________________________________________________
batch_normalization_3 (Batch (None, 6, 6, 384)         1536
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 4, 384)         1327488
_________________________________________________________________
activation_4 (Activation)    (None, 4, 4, 384)         0
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 4, 384)         1536
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 2, 256)         884992
_________________________________________________________________
activation_5 (Activation)    (None, 2, 2, 256)         0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 1, 1, 256)         0
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 1, 256)         1024
_________________________________________________________________
flatten_1 (Flatten)          (None, 256)               0
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              1052672
_________________________________________________________________
activation_6 (Activation)    (None, 4096)              0
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0
_________________________________________________________________
batch_normalization_6 (Batch (None, 4096)              16384
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312
_________________________________________________________________
activation_7 (Activation)    (None, 4096)              0
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0
_________________________________________________________________
batch_normalization_7 (Batch (None, 4096)              16384
_________________________________________________________________
dense_3 (Dense)              (None, 1000)              4097000
_________________________________________________________________
activation_8 (Activation)    (None, 1000)              0
_________________________________________________________________
dropout_3 (Dropout)          (None, 1000)              0
_________________________________________________________________
batch_normalization_8 (Batch (None, 1000)              4000
_________________________________________________________________
dense_4 (Dense)              (None, 15)                15015
_________________________________________________________________
activation_9 (Activation)    (None, 15)                0
=================================================================
Total params: 28,094,767
Trainable params: 28,073,631
Non-trainable params: 21,136
_________________________________________________________________
Epoch 1/100
3588/3588 [==============================] - 19s 5ms/step - loss: 3.1344 - accuracy: 0.1920
Epoch 2/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.6599 - accuracy: 0.2313
Epoch 3/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.4430 - accuracy: 0.2520
Epoch 4/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.4015 - accuracy: 0.2561
Epoch 5/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.3164 - accuracy: 0.2678
Epoch 6/100
3588/3588 [==============================] - 8s 2ms/step - loss: 2.1576 - accuracy: 0.3043
Epoch 7/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.2354 - accuracy: 0.2896
Epoch 8/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0890 - accuracy: 0.3400
Epoch 9/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.1569 - accuracy: 0.3166
Epoch 10/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.9667 - accuracy: 0.3615
Epoch 11/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0174 - accuracy: 0.3478
Epoch 12/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8641 - accuracy: 0.3874
Epoch 13/100
3588/3588 [==============================] - 6s 2ms/step - loss: 1.9755 - accuracy: 0.3554
Epoch 14/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0062 - accuracy: 0.3632
Epoch 15/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0160 - accuracy: 0.3559
Epoch 16/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0033 - accuracy: 0.3501
Epoch 17/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8014 - accuracy: 0.4089
Epoch 18/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.9729 - accuracy: 0.3593
Epoch 19/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.9206 - accuracy: 0.3682
Epoch 20/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.8496 - accuracy: 0.3905
Epoch 21/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.7002 - accuracy: 0.4395
Epoch 22/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.6496 - accuracy: 0.4560
Epoch 23/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5834 - accuracy: 0.4660
Epoch 24/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5247 - accuracy: 0.4844
Epoch 25/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4623 - accuracy: 0.5042
Epoch 26/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4245 - accuracy: 0.5190
Epoch 27/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4752 - accuracy: 0.4978
Epoch 28/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3456 - accuracy: 0.5379
Epoch 29/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.1969 - accuracy: 0.5747
Epoch 30/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.9621 - accuracy: 0.3891
Epoch 31/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5398 - accuracy: 0.4716
Epoch 32/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4481 - accuracy: 0.5020
Epoch 33/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3156 - accuracy: 0.5468
Epoch 34/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.2686 - accuracy: 0.5580
Epoch 35/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.9256 - accuracy: 0.3877
Epoch 36/100
3588/3588 [==============================] - 6s 2ms/step - loss: 1.4627 - accuracy: 0.5061
Epoch 37/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4546 - accuracy: 0.5053
Epoch 38/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4465 - accuracy: 0.5036
Epoch 39/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8519 - accuracy: 0.3977
Epoch 40/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4478 - accuracy: 0.5100
Epoch 41/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4342 - accuracy: 0.5067
Epoch 42/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.2695 - accuracy: 0.5538
Epoch 43/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3643 - accuracy: 0.5279
Epoch 44/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.2453 - accuracy: 0.5644
Epoch 45/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.7217 - accuracy: 0.4557
Epoch 46/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3541 - accuracy: 0.5307
Epoch 47/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5166 - accuracy: 0.4769
Epoch 48/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.2947 - accuracy: 0.5399
Epoch 49/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8334 - accuracy: 0.4030
Epoch 50/100
3588/3588 [==============================] - 8s 2ms/step - loss: 2.4398 - accuracy: 0.2701
Epoch 51/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.9494 - accuracy: 0.3495
Epoch 52/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8001 - accuracy: 0.3927
Epoch 53/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8292 - accuracy: 0.3966
Epoch 54/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.6722 - accuracy: 0.4445
Epoch 55/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.6876 - accuracy: 0.4234
Epoch 56/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.5051 - accuracy: 0.4961
Epoch 57/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4289 - accuracy: 0.5011
Epoch 58/100
3588/3588 [==============================] - 9s 2ms/step - loss: 1.3942 - accuracy: 0.5187
Epoch 59/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.3143 - accuracy: 0.5429
Epoch 60/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4439 - accuracy: 0.5159
Epoch 61/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3807 - accuracy: 0.5390
Epoch 62/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3547 - accuracy: 0.5309
Epoch 63/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.1825 - accuracy: 0.5878
Epoch 64/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.1332 - accuracy: 0.6051
Epoch 65/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0397 - accuracy: 0.3729
Epoch 66/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.5999 - accuracy: 0.4373
Epoch 67/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4879 - accuracy: 0.4830
Epoch 68/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.7583 - accuracy: 0.4133
Epoch 69/100
3588/3588 [==============================] - 6s 2ms/step - loss: 1.7365 - accuracy: 0.4080
Epoch 70/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4581 - accuracy: 0.4894
Epoch 71/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.8044 - accuracy: 0.4228
Epoch 72/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5252 - accuracy: 0.4716
Epoch 73/100
3588/3588 [==============================] - 7s 2ms/step - loss: 2.0484 - accuracy: 0.3604
Epoch 74/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.6470 - accuracy: 0.4409
Epoch 75/100
3588/3588 [==============================] - 9s 2ms/step - loss: 1.9210 - accuracy: 0.3724
Epoch 76/100
3588/3588 [==============================] - 9s 2ms/step - loss: 1.8387 - accuracy: 0.3949
Epoch 77/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.6013 - accuracy: 0.4590
Epoch 78/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.6030 - accuracy: 0.4590
Epoch 79/100
3588/3588 [==============================] - 9s 2ms/step - loss: 1.5003 - accuracy: 0.4883
Epoch 80/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.3770 - accuracy: 0.5229
Epoch 81/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.3116 - accuracy: 0.5463
Epoch 82/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.2612 - accuracy: 0.5633
Epoch 83/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.2370 - accuracy: 0.5708
Epoch 84/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.2441 - accuracy: 0.5599
Epoch 85/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.4846 - accuracy: 0.5123
Epoch 86/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5029 - accuracy: 0.4928
Epoch 87/100
3588/3588 [==============================] - 8s 2ms/step - loss: 2.0572 - accuracy: 0.3609
Epoch 88/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.6669 - accuracy: 0.4398
Epoch 89/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.4192 - accuracy: 0.5117
Epoch 90/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.5966 - accuracy: 0.4635
Epoch 91/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.7644 - accuracy: 0.4091
Epoch 92/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.4465 - accuracy: 0.5056
Epoch 93/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.3045 - accuracy: 0.5477
Epoch 94/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.3841 - accuracy: 0.5245
Epoch 95/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.2813 - accuracy: 0.5610
Epoch 96/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.3233 - accuracy: 0.5518
Epoch 97/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.2176 - accuracy: 0.5711
Epoch 98/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.1592 - accuracy: 0.5903
Epoch 99/100
3588/3588 [==============================] - 7s 2ms/step - loss: 1.0940 - accuracy: 0.6112
Epoch 100/100
3588/3588 [==============================] - 8s 2ms/step - loss: 1.0611 - accuracy: 0.6249
Test loss: 1.3636012096601717
Test accuracy: 0.5540691018104553
